todo-api/app/controllers/tags_controller.rb

SELECT "tags".* FROM "tags" ORDER BY created_at DESC
---
    def index
        tags = Tag.order("created_at DESC")

SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        tag = Tag.find(params[:id])

SELECT "tasks".* FROM "tasks" INNER JOIN "tags_tasks" ON "tasks"."id" = "tags_tasks"."task_id" WHERE "tags_tasks"."tag_id" = ?  [["tag_id", 1]]
SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show_tasks
        tag_tasks = Tag.find(params[:id]).tasks

INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Webdev"], ["created_at", "2022-01-21 07:39:03.495208"], ["updated_at", "2022-01-21 07:39:03.495208"]]
---
    def create
        tag = Tag.create(tag_params)

SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 18]]
---
    def destroy
        tag = Tag.find(params[:id])
        tag.destroy

SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
INSERT INTO "tags_tasks" ("tag_id", "task_id") VALUES (?, ?)  [["tag_id", 16], ["task_id", 28]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 28], ["LIMIT", 1]]
DELETE FROM "tags_tasks" WHERE "tags_tasks"."tag_id" = ? AND "tags_tasks"."task_id" = ?  [["tag_id", 16], ["task_id", 28]]
---
    def update
        tag = Tag.find(params[:id])

        if (params[:do].eql? "add")
            tag.tasks << Task.find(params[:task])
            render :json => tag.to_json(:include => [:tasks])
        elsif (params[:do].eql? "delete")
            tag.tasks.delete(Task.find(params[:task]))