todo-api/app/controllers/tasks_controller.rb

  def index
    tasks = Task.order("created_at DESC")
---
SELECT "tasks".* FROM "tasks" ORDER BY created_at DESC

    task = Task.find(params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    task = Task.create(task_params)
---
INSERT INTO "tasks" ("title", "description", "deadline", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?, ?)

    task = Task.find(params[:id])
    task.update(task_params)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "tasks" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["title", "Hiking Trip "], ["description", "Go on a hike"], ["updated_at", "2022-01-21 08:14:34.379542"], ["id", 27]]